tests/com/l7tech/service/resources/wssInterop/oracleRequest.xml

<?xml version = '1.0' encoding = 'UTF-8'?>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns0="http://xmlsoap.org/Ping" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><env:Header><wsse11:EncryptedHeader xmlns="http://docs.oasis-open.org/wss/2005/xx/oasis-2005xx-wss-wssecurity-secext-1.1.xsd" xmlns:wsse11="http://docs.oasis-open.org/wss/2005/xx/oasis-2005xx-wss-wssecurity-secext-1.1.xsd" wsu:Id="_mG9E9m59bkgTMyfDZqKLlg22" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><xenc:EncryptedData xmlns="http://www.w3.org/2001/04/xmlenc#" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Element" Id="_O9O1H0Qf0B3DnnZDTufAMA22"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes256-cbc"/><xenc:CipherData><xenc:CipherValue>Z7XfMHi8tTYlMG6o4YB7+jhCbmFcWKktOJozo+JcWOuTfvK6bpWZSeJoNtQMzg/pIUrMoiOcAPoYW75Qu+eey4wQk7uVMyJsAJnNsf8EU6BN3HAUUyMMKJeC6XfF914NRXcYA2KE1CvzbtuEwOWRkcafsZACDZRcIpSt4Vtx8Twj+vG3576Cwn8Gl1gX7KXBr3Lnq3F4ulpy4xmGh2iEyxzZOcwfq0iU3R+WdDM7BIX2O7HDkzzK5HD6e5aEXP6ePMvR0AMPkxvVwpS/6Mu87Ffg/OAFnHZnFL82HgITpEo=</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></wsse11:EncryptedHeader><wsse:Security xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" env:mustUnderstand="1"><wsu:Timestamp xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="J69Q20E7awUbYE1urjhwvQ22"><wsu:Created>2005-08-08T19:28:31Z</wsu:Created><wsu:Expires>2005-08-09T03:28:31Z</wsu:Expires></wsu:Timestamp><xenc:EncryptedKey xmlns="http://www.w3.org/2001/04/xmlenc#" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Id="Mpf09cTGoWhuYfLC5zpmNg22"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><dsig:KeyInfo xmlns:dsig="http://www.w3.org/2000/09/xmldsig#"><wsse:SecurityTokenReference xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><wsse:KeyIdentifier xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" ValueType="http://docs.oasis-open.org/wss/2005/xx/oasis-2005xx-wss-soap-message-security-1.1#ThumbprintSHA1" EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">NQM0IBvuplAtETQvk+6gn8C13wE=
</wsse:KeyIdentifier></wsse:SecurityTokenReference></dsig:KeyInfo><xenc:CipherData><xenc:CipherValue>jSoYHcNfcJBnRPi0HI8LLTbqN/U7iU26sPHqEccD62vSeF538hEzuJSI3O7LgjWGsen/2fJto9gNOp8C17ZlKj+utYuWABMJPmeWqloIi3ot7GA6EKNzlfcmy6OjgFMnZR7mpMf7ycNqUJaOPqaWbauEINJijCpqkV+NJdrcPyA=</xenc:CipherValue></xenc:CipherData><xenc:ReferenceList><xenc:DataReference URI="#_mG9E9m59bkgTMyfDZqKLlg22"/><xenc:DataReference URI="#_itl5a9j6a3UpGIQ3gUbWGQ22"/><xenc:DataReference URI="#_BlrKpVFc2aSHA8BBlusjuQ22"/></xenc:ReferenceList></xenc:EncryptedKey><xenc:EncryptedData xmlns="http://www.w3.org/2001/04/xmlenc#" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Element" Id="_itl5a9j6a3UpGIQ3gUbWGQ22"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes256-cbc"/><xenc:CipherData><xenc:CipherValue>kGdO/NbftiLV+bMeFPbYR/yA/BGlEPSxvJ8U4H5+ddHUOC8tlUsMnfFkACkDydaM87F0915tZCrrFgn8sJM97Khrsg4v5jcacnt4leGfSsSZTtMp5W1TdJRE3cZB5y8M/pUXKqlRp7EBCyOyU4anZwr+VTm2N3PWQ/IMqfS0/ND2yLO5MoX9bCZ0LS3th+LT6IJ8isDFOf/5O4Cn62B0QSq/xViXzRADX3948elnMJzZy+oscRR03ojStKvkVU/wdR03O+1zM055B7l2lgYRqYvFlWR9mRcnfT7iiaARRDyBF5BxLEUWQIR1z3HqjkSC+ZvjIPMjsMyhrpOJ0o35jG11fXZUzRIokZ5Z+rVUSXnuHxDlq2j5Fmbxm+qRUTd/nTwcmWi4s91Dqd68kY0YPPCkuybr4jeNf3ixAg9pHdus0hTjU1gqZqrekQveGRJtGSr8EdO1Wb/VX3ShbYMhJ/jFRWuxh4mTCoezAxtxkc+rT3F1dhxdy6UM4ONJwudRLCUAQSAUR67LUZpWW9JLDxRu49u5c7ckrSUDtCrBn46sbObSu3V6bEYYW6n6aRvMLBbew5QNUVcyaZy8MUeWpJfCr/CFQCqb3K+XfnHyd/EsCNmmiYdd7zdNd0pHjemP2RTQtv91TQy/ngJV56SkdpILiUaHZCZRe1VTjweQIz9rDkYqLT7JYPStIRKSMZnrsgBvGqC7Qu9VxnnX+hbkcI2kr0X3pZ2seb+9AKQyFhw=</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData><dsig:Signature xmlns="http://www.w3.org/2000/09/xmldsig#" xmlns:dsig="http://www.w3.org/2000/09/xmldsig#"><dsig:SignedInfo><dsig:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><dsig:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#hmac-sha1"/><dsig:Reference URI="#123"><dsig:Transforms><dsig:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></dsig:Transforms><dsig:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><dsig:DigestValue>u4E2C4cKBS8xRZ/hF0bMSrc/7uo=</dsig:DigestValue></dsig:Reference><dsig:Reference URI="#Bi3DVZ8iRyAFXGHZx0bnpQ22"><dsig:Transforms><dsig:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></dsig:Transforms><dsig:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><dsig:DigestValue>stMZGMVa/Q1weDbBvrskTojWpBc=</dsig:DigestValue></dsig:Reference><dsig:Reference URI="#0ag6V9trXOF44UR1KJ1eyQ22"><dsig:Transforms><dsig:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></dsig:Transforms><dsig:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><dsig:DigestValue>RVj7lfu5wNbVVg500NZ0AMoorYM=</dsig:DigestValue></dsig:Reference><dsig:Reference URI="#J69Q20E7awUbYE1urjhwvQ22"><dsig:Transforms><dsig:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></dsig:Transforms><dsig:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><dsig:DigestValue>WuxGT4DrEuRE9MPc8raBxo5MJR8=</dsig:DigestValue></dsig:Reference></dsig:SignedInfo><dsig:SignatureValue>Jwbya9l2U7Q7dMiqnihnTxqsiZw=</dsig:SignatureValue><dsig:KeyInfo><wsse:SecurityTokenReference xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><wsse:Reference xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" URI="#Mpf09cTGoWhuYfLC5zpmNg22"/></wsse:SecurityTokenReference></dsig:KeyInfo></dsig:Signature></wsse:Security></env:Header><env:Body wsu:Id="0ag6V9trXOF44UR1KJ1eyQ22" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><xenc:EncryptedData xmlns="http://www.w3.org/2001/04/xmlenc#" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content" Id="_BlrKpVFc2aSHA8BBlusjuQ22"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes256-cbc"/><xenc:CipherData><xenc:CipherValue>7g3m/kcD5CbyArdHzHh+sYsuQ2YeWereCdk4Z6C03dZFOFNVv87pbP9GEliivzanCgu5RPTTfwBh7kHUiJhkKU2sP1Fie7/MzAvN8eAVFs8=</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></env:Body></env:Envelope>